In [25]:
import glob
import pandas as pd

# Baby Names by State

In [26]:
dirpath = "./namesbystate/"
csv_files = glob.glob(dirpath + "/*.TXT")

df_list = []
for f in csv_files:
    df_list.append(pd.read_csv(f, header=None, 
                               names=["state", "gender", "year", "name", "occurrences"]))

In [27]:
big_df = pd.concat(df_list, ignore_index=True, axis=0)
len(big_df)

6408041

In [28]:
big_df.head(10)

  state gender  year      name  occurrences
0    ID      F  1910      Mary           53
1    ID      F  1910   Dorothy           31
2    ID      F  1910     Helen           30
3    ID      F  1910  Margaret           24
4    ID      F  1910      Ruth           24
5    ID      F  1910    Gladys           20
6    ID      F  1910     Alice           19
7    ID      F  1910   Mildred           19
8    ID      F  1910    Thelma           19
9    ID      F  1910     Edith           17

In [29]:
big_df.to_csv("./output/namesbystate_combined.csv")

In [30]:
# TODO: assign rankings?

In [31]:
subset_df = big_df.groupby(["year", "state", "gender"]).apply(
    lambda x: x.sort_values(by="occurrences", ascending=False).head(1)).copy()

In [32]:
subset_df.to_csv("./output/subset_df.csv")

In [33]:
subset_df.info()

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 11526 entries, (1910, 'AK', 'F', 2838142) to (2022, 'WY', 'M', 4598904)
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   state        11526 non-null  object
 1   gender       11526 non-null  object
 2   year         11526 non-null  int64
 3   name         11526 non-null  object
 4   occurrences  11526 non-null  int64
dtypes: int64(2), object(3)
memory usage: 862.3+ KB

# Exploring popularity of "-den" names

In [34]:
big_df[(big_df["name"].str.endswith("den")) | \
       (big_df["name"].str.endswith("dan")) | \
       (big_df["name"].str.endswith("dyn")) \
      ].sort_values(by="occurrences", ascending=False).head(20)

        state gender  year    name  occurrences
3292085    CA      M  2012  Jayden         2871
3289196    CA      M  2011  Jayden         2754
3295001    CA      M  2013  Jayden         2581
3286287    CA      M  2010  Jayden         2444
3297902    CA      M  2014  Jayden         2383
3283365    CA      M  2009  Jayden         2263
3300842    CA      M  2015  Jayden         2134
3280458    CA      M  2008  Jayden         2055
3292096    CA      M  2012   Aiden         2003
3286298    CA      M  2010   Aiden         1941
3289209    CA      M  2011   Aiden         1913
3300847    CA      M  2015   Aiden         1907
2426493    TX      M  2013  Jayden         1902
2421306    TX      M  2011  Jayden         1886
3297909    CA      M  2014   Aiden         1883
2423879    TX      M  2012  Jayden         1882
3303783    CA      M  2016  Jayden         1861
2418729    TX      M  2010  Jayden         1820
3283372    CA      M  2009   Aiden         1804
3280465    CA      M  2008   Aiden         1793

# All Baby Names by Year and Gender

In [35]:
import re

dirpath = "./names/"
csv_files = glob.glob(dirpath + "/*.txt")

regex_str = re.compile(f"yob(\d\d\d\d).txt")

df_list = []
for f in csv_files:
    year = re.search(regex_str, f).groups()[0]
    temp_df = pd.read_csv(
        f, header=None, 
        names=["name", "gender", "occurrences"])
    temp_df.insert(1, "year", year)
    df_list.append(temp_df)

print(df_list)

[          name  year gender  occurrences
0        Emily  2000      F        25957
1       Hannah  2000      F        23085
2      Madison  2000      F        19968
3       Ashley  2000      F        17998
4        Sarah  2000      F        17712
...        ...   ...    ...          ...
29771     Zeph  2000      M            5
29772    Zeven  2000      M            5
29773    Ziggy  2000      M            5
29774       Zo  2000      M            5
29775    Zyier  2000      M            5

[29776 rows x 4 columns],            name  year gender  occurrences
0          Emma  2014      F        20958
1        Olivia  2014      F        19829
2        Sophia  2014      F        18636
3      Isabella  2014      F        17125
4           Ava  2014      F        15721
...         ...   ...    ...          ...
33289    Zykeem  2014      M            5
33290    Zymeer  2014      M            5
33291   Zymiere  2014      M            5
33292     Zyran  2014      M            5
33293     Zyrin  2014      M            5

[33294 rows x 4 columns],           name  year gender  occurrences
0         Mary  1938      F        56216
1      Barbara  1938      F        39276
2     Patricia  1938      F        27557
3        Betty  1938      F        25506
4      Shirley  1938      F        23767
...        ...   ...    ...          ...
9026      Zach  1938      M            5
9027    Zannie  1938      M            5
9028  Zeferino  1938      M            5
9029   Zelbert  1938      M            5
9030     Zenon  1938      M            5

[9031 rows x 4 columns],           name  year gender  occurrences
0         Mary  1910      F        22848
1        Helen  1910      F        10479
2     Margaret  1910      F         8226
3      Dorothy  1910      F         7318
4         Ruth  1910      F         7212
...        ...   ...    ...          ...
4624   Woodson  1910      M            5
4625     Woody  1910      M            5
4626     Wyman  1910      M            5
4627    Yoshio  1910      M            5
4628    Zennie  1910      M            5

[4629 rows x 4 columns],           name  year gender  occurrences
0         Mary  1904      F        14961
1        Helen  1904      F         6488
2         Anna  1904      F         5330
3     Margaret  1904      F         5302
4         Ruth  1904      F         4900
...        ...   ...    ...          ...
3555   Willian  1904      M            5
3556    Woodie  1904      M            5
3557     Woody  1904      M            5
3558    Worley  1904      M            5
3559       Yee  1904      M            5

[3560 rows x 4 columns],           name  year gender  occurrences
0         Mary  1905      F        16067
1        Helen  1905      F         6811
2     Margaret  1905      F         5690
3         Anna  1905      F         5424
4         Ruth  1905      F         5068
...        ...   ...    ...          ...
3650   Wilburt  1905      M            5
3651   Wilfrid  1905      M            5
3652   Willian  1905      M            5
3653  Winifred  1905      M            5
3654   Woodson  1905      M            5

[3655 rows x 4 columns],           name  year gender  occurrences
0         Mary  1911      F        24390
1        Helen  1911      F        11801
2     Margaret  1911      F         9279
3      Dorothy  1911      F         8869
4         Ruth  1911      F         8003
...        ...   ...    ...          ...
4862  Woodford  1911      M            5
4863     Woody  1911      M            5
4864    Yoshio  1911      M            5
4865     Zenas  1911      M            5
4866     Zenon  1911      M            5

[4867 rows x 4 columns],            name  year gender  occurrences
0          Mary  1939      F        54902
1       Barbara  1939      F        37258
2      Patricia  1939      F        29706
3         Betty  1939      F        23645
4       Shirley  1939      F        20448
...         ...   ...    ...          ...
8913     Yoshio  1939      M            5
8914      Yukio  1939      M            5
8915  Zachariah  1939      M            5
8916      Zelma  1939      M            5
8917      Zenon  1939      M            5

[8918 rows x 4 columns],            name  year gender  occurrences
0          Emma  2015      F        20478
1        Olivia  2015      F        19717
2        Sophia  2015      F        17445
3           Ava  2015      F        16399
4      Isabella  2015      F        15646
...         ...   ...    ...          ...
33165    Zykell  2015      M            5
33166    Zyking  2015      M            5
33167     Zykir  2015      M            5
33168     Zyrus  2015      M            5
33169      Zyus  2015      M            5

[33170 rows x 4 columns],           name  year gender  occurrences
0        Emily  2001      F        25059
1      Madison  2001      F        22166
2       Hannah  2001      F        20720
3       Ashley  2001      F        16531
4       Alexis  2001      F        16403
...        ...   ...    ...          ...
30276     Zyad  2001      M            5
30277    Zyere  2001      M            5
30278    Zykel  2001      M            5
30279    Zyrek  2001      M            5
30280  Zyshaun  2001      M            5

[30281 rows x 4 columns],            name  year gender  occurrences
0          Emma  2017      F        19857
1        Olivia  2017      F        18763
2           Ava  2017      F        16005
3      Isabella  2017      F        15231
4        Sophia  2017      F        14925
...         ...   ...    ...          ...
32665     Zykir  2017      M            5
32666     Zylin  2017      M            5
32667     Zylis  2017      M            5
32668     Zylyn  2017      M            5
32669     Zyrie  2017      M            5

[32670 rows x 4 columns],           name  year gender  occurrences
0        Emily  2003      F        25691
1         Emma  2003      F        22714
2      Madison  2003      F        20201
3       Hannah  2003      F        17638
4       Olivia  2003      F        16152
...        ...   ...    ...          ...
31189   Zorion  2003      M            5
31190  Zxavian  2003      M            5
31191     Zyad  2003      M            5
31192   Zykeem  2003      M            5
31193   Zysean  2003      M            5

[31194 rows x 4 columns],           name  year gender  occurrences
0         Mary  1907      F        17580
1        Helen  1907      F         7579
2     Margaret  1907      F         6713
3         Anna  1907      F         5575
4         Ruth  1907      F         5573
...        ...   ...    ...          ...
3943      Wray  1907      M            5
3944     Wyman  1907      M            5
3945       Zeb  1907      M            5
3946      Zeke  1907      M            5
3947      Zeno  1907      M            5

[3948 rows x 4 columns],           name  year gender  occurrences
0         Mary  1913      F        36642
1        Helen  1913      F        18888
2      Dorothy  1913      F        14674
3     Margaret  1913      F        14486
4         Ruth  1913      F        12609
...        ...   ...    ...          ...
6963    Yutaka  1913      M            5
6964      Zach  1913      M            5
6965    Zeddie  1913      M            5
6966     Zenas  1913      M            5
6967     Zenus  1913      M            5

[6968 rows x 4 columns],           name  year gender  occurrences
0         Mary  1898      F        14406
1         Anna  1898      F         5773
2        Helen  1898      F         5230
3     Margaret  1898      F         4696
4         Ruth  1898      F         4249
...        ...   ...    ...          ...
3259     Wince  1898      M            5
3260   Winford  1898      M            5
3261      Wing  1898      M            5
3262     Wyman  1898      M            5
3263       Zed  1898      M            5

[3264 rows x 4 columns],           name  year gender  occurrences
0         Mary  1899      F        13172
1         Anna  1899      F         5115
2        Helen  1899      F         5048
3     Margaret  1899      F         4249
4         Ruth  1899      F         3912
...        ...   ...    ...          ...
3037    Waddie  1899      M            5
3038   Wilhelm  1899      M            5
3039   Winford  1899      M            5
3040    Winton  1899      M            5
3041     Young  1899      M            5

[3042 rows x 4 columns],           name  year gender  occurrences
0         Mary  1912      F        32304
1        Helen  1912      F        16133
2      Dorothy  1912      F        12645
3     Margaret  1912      F        12536
4         Ruth  1912      F        11280
...        ...   ...    ...          ...
6345     Woods  1912      M            5
6346      Wray  1912      M            5
6347      Wynn  1912      M            5
6348      York  1912      M            5
6349    Yutaka  1912      M            5

[6350 rows x 4 columns],           name  year gender  occurrences
0         Mary  1906      F        16370
1        Helen  1906      F         7176
2     Margaret  1906      F         6096
3         Anna  1906      F         5502
4         Ruth  1906      F         5140
...        ...   ...    ...          ...
3628  Winifred  1906      M            5
3629   Winslow  1906      M            5
3630      Wray  1906      M            5
3631     Wyman  1906      M            5
3632    Zeddie  1906      M            5

[3633 rows x 4 columns],           name  year gender  occurrences
0        Emily  2002      F        24468
1      Madison  2002      F        21773
2       Hannah  2002      F        18827
3         Emma  2002      F        16554
4       Alexis  2002      F        15636
...        ...   ...    ...          ...
30567    Zimri  2002      M            5
30568    Zoran  2002      M            5
30569     Zyen  2002      M            5
30570    Zylan  2002      M            5
30571    Zyonn  2002      M            5

[30572 rows x 4 columns],            name  year gender  occurrences
0          Emma  2016      F        19536
1        Olivia  2016      F        19397
2           Ava  2016      F        16338
3        Sophia  2016      F        16171
4      Isabella  2016      F        14846
...         ...   ...    ...          ...
33054    Zolton  2016      M            5
33055    Zurich  2016      M            5
33056    Zyahir  2016      M            5
33057      Zyel  2016      M            5
33058     Zylyn  2016      M            5

[33059 rows x 4 columns],             name  year gender  occurrences
0         Sophia  2012      F        22325
1           Emma  2012      F        20964
2       Isabella  2012      F        19126
3         Olivia  2012      F        17328
4            Ava  2012      F        15545
...          ...   ...    ...          ...
33766      Zylin  2012      M            5
33767     Zymari  2012      M            5
33768      Zyrin  2012      M            5
33769      Zyrus  2012      M            5
33770  Zytaevius  2012      M            5

[33771 rows x 4 columns],              name  year gender  occurrences
0           Emily  2006      F        21410
1            Emma  2006      F        19126
2         Madison  2006      F        18632
3        Isabella  2006      F        18228
4             Ava  2006      F        16943
...           ...   ...    ...          ...
34097      Zymire  2006      M            5
34098  Zyquavious  2006      M            5
34099      Zyrell  2006      M            5
34100     Zyshaun  2006      M            5
34101     Zyshawn  2006      M            5

[34102 rows x 4 columns],           name  year gender  occurrences
0         Mary  1902      F        14486
1        Helen  1902      F         5967
2         Anna  1902      F         5288
3     Margaret  1902      F         5011
4         Ruth  1902      F         4384
...        ...   ...    ...          ...
3357   Woodrow  1902      M            5
3358    Wright  1902      M            5
3359     Wyman  1902      M            5
3360     Yancy  1902      M            5
3361    Zollie  1902      M            5

[3362 rows x 4 columns],           name  year gender  occurrences
0         Mary  1916      F        61438
1        Helen  1916      F        32661
2      Dorothy  1916      F        27418
3     Margaret  1916      F        24953
4         Ruth  1916      F        23189
...        ...   ...    ...          ...
9691     Zelma  1916      M            5
9692      Zera  1916      M            5
9693    Zettie  1916      M            5
9694      Ziba  1916      M            5
9695      Zina  1916      M            5

[9696 rows x 4 columns],            name  year gender  occurrences
0          Mary  1889      F        11648
1          Anna  1889      F         5062
2     Elizabeth  1889      F         3058
3      Margaret  1889      F         2917
4          Emma  1889      F         2884
...         ...   ...    ...          ...
2585     Weldon  1889      M            5
2586    Wendell  1889      M            5
2587    Wilhelm  1889      M            5
2588       Zeke  1889      M            5
2589      Zenas  1889      M            5

[2590 rows x 4 columns],            name  year gender  occurrences
0          Mary  1888      F        11754
1          Anna  1888      F         4982
2     Elizabeth  1888      F         3224
3          Emma  1888      F         3087
4      Margaret  1888      F         2904
...         ...   ...    ...          ...
2646     Vaughn  1888      M            5
2647     Vernie  1888      M            5
2648       Watt  1888      M            5
2649    Winston  1888      M            5
2650      Zelma  1888      M            5

[2651 rows x 4 columns],            name  year gender  occurrences
0          Mary  1917      F        64280
1         Helen  1917      F        34251
2       Dorothy  1917      F        28852
3      Margaret  1917      F        25560
4          Ruth  1917      F        23568
...         ...   ...    ...          ...
9907  Yoshiharu  1917      M            5
9908    Zebulon  1917      M            5
9909     Zeddie  1917      M            5
9910       Zeke  1917      M            5
9911       Zola  1917      M            5

[9912 rows x 4 columns],           name  year gender  occurrences
0         Mary  1903      F        14275
1        Helen  1903      F         6129
2         Anna  1903      F         5098
3     Margaret  1903      F         5046
4         Ruth  1903      F         4517
...        ...   ...    ...          ...
3384      Webb  1903      M            5
3385   Wilburt  1903      M            5
3386    Worthy  1903      M            5
3387     Young  1903      M            5
3388    Zollie  1903      M            5

[3389 rows x 4 columns],              name  year gender  occurrences
0           Emily  2007      F        19359
1        Isabella  2007      F        19140
2            Emma  2007      F        18381
3             Ava  2007      F        18053
4         Madison  2007      F        17965
...           ...   ...    ...          ...
34961       Zylin  2007      M            5
34962       Zyonn  2007      M            5
34963   Zyquarius  2007      M            5
34964  Zyquavious  2007      M            5
34965      Zyrese  2007      M            5

[34966 rows x 4 columns],            name  year gender  occurrences
0        Sophia  2013      F        21244
1          Emma  2013      F        20958
2        Olivia  2013      F        18446
3      Isabella  2013      F        17663
4           Ava  2013      F        15265
...         ...   ...    ...          ...
33324     Zyere  2013      M            5
33325     Zylar  2013      M            5
33326    Zymari  2013      M            5
33327    Zymeer  2013      M            5
33328     Zyree  2013      M            5

[33329 rows x 4 columns],             name  year gender  occurrences
0          Emily  2005      F        23949
1           Emma  2005      F        20353
2        Madison  2005      F        19577
3        Abigail  2005      F        15755
4         Olivia  2005      F        15699
...          ...   ...    ...          ...
32554    Zymiere  2005      M            5
32555     Zyrell  2005      M            5
32556     Zyrian  2005      M            5
32557     Zyshon  2005      M            5
32558  Zytavious  2005      M            5

[32559 rows x 4 columns],            name  year gender  occurrences
0        Sophia  2011      F        21856
1      Isabella  2011      F        19927
2          Emma  2011      F        18814
3        Olivia  2011      F        17331
4           Ava  2011      F        15512
...         ...   ...    ...          ...
33929     Zylar  2011      M            5
33930     Zylas  2011      M            5
33931     Zyran  2011      M            5
33932   Zyshawn  2011      M            5
33933  Zytavion  2011      M            5

[33934 rows x 4 columns],            name  year gender  occurrences
0          Mary  1915      F        58187
1         Helen  1915      F        30866
2       Dorothy  1915      F        25154
3      Margaret  1915      F        23054
4          Ruth  1915      F        21878
...         ...   ...    ...          ...
9352     Yewell  1915      M            5
9353  Zachariah  1915      M            5
9354      Zelma  1915      M            5
9355       Zora  1915      M            5
9356    Zygmont  1915      M            5

[9357 rows x 4 columns],           name  year gender  occurrences
0         Mary  1901      F        13136
1        Helen  1901      F         5247
2         Anna  1901      F         4923
3     Margaret  1901      F         4424
4         Ruth  1901      F         3974
...        ...   ...    ...          ...
3148     Welby  1901      M            5
3149   Westley  1901      M            5
3150  Williard  1901      M            5
3151     Young  1901      M            5
3152       Zeb  1901      M            5

[3153 rows x 4 columns],           name  year gender  occurrences
0         Mary  1929      F        63512
1        Betty  1929      F        36674
2      Dorothy  1929      F        31476
3        Helen  1929      F        20982
4     Margaret  1929      F        19209
...        ...   ...    ...          ...
9817   Yoshimi  1929      M            5
9818   Yoshiro  1929      M            5
9819  Zeferino  1929      M            5
9820      Zell  1929      M            5
9821   Zygmund  1929      M            5

[9822 rows x 4 columns],             name  year gender  occurrences
0           Mary  1928      F        66870
1          Betty  1928      F        36082
2        Dorothy  1928      F        33734
3          Helen  1928      F        22936
4       Margaret  1928      F        20296
...          ...   ...    ...          ...
10156      Wynne  1928      M            5
10157     Yvonne  1928      M            5
10158  Zachariah  1928      M            5
10159     Zebbie  1928      M            5
10160     Zolton  1928      M            5

[10161 rows x 4 columns],           name  year gender  occurrences
0         Mary  1900      F        16705
1        Helen  1900      F         6342
2         Anna  1900      F         6114
3     Margaret  1900      F         5304
4         Ruth  1900      F         4765
...        ...   ...    ...          ...
3724     White  1900      M            5
3725   Wilhelm  1900      M            5
3726  Winifred  1900      M            5
3727    Woodie  1900      M            5
3728      Zeno  1900      M            5

[3729 rows x 4 columns],           name  year gender  occurrences
0         Mary  1914      F        45346
1        Helen  1914      F        23221
2      Dorothy  1914      F        18782
3     Margaret  1914      F        17763
4         Ruth  1914      F        15839
...        ...   ...    ...          ...
7960    Wister  1914      M            5
7961   Wofford  1914      M            5
7962     Yasuo  1914      M            5
7963      Zell  1914      M            5
7964    Zenith  1914      M            5


In [36]:
big_df = pd.concat(df_list, ignore_index=True, axis=0)

# Assessing Most Popular and Most Unique Baby Names

In [37]:
highest_df = big_df.groupby(["year", "gender"]).apply(
    lambda x: x[x["occurrences"] == x["occurrences"].max()]).copy()

In [38]:
", ".join(sorted(highest_df["name"].unique()))

'Ashley, David, Emily, Emma, Isabella, Jacob, James, Jennifer, Jessica, John, Liam, Linda, Lisa, Mary, Michael, Noah, Olivia, Robert, Sophia'

In [39]:
highest_df.info()

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 286 entries, ('1880', 'F', 1935794) to ('2022', 'M', 1849802)
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         286 non-null    object
 1   year         286 non-null    object
 2   gender       286 non-null    object
 3   occurrences  286 non-null    int64
dtypes: int64(1), object(3)
memory usage: 26.1+ KB

In [40]:
highest_df.to_csv("./output/most_popular_names_1880_2022.csv")

## Flourish connected scatter plot
<a href='https://public.flourish.studio/visualisation/14251422/'>Most Popular Baby Names</a>

In [41]:
lowest_df = big_df.groupby(["year", "gender"]).apply(
    lambda x: x[x["occurrences"] == x["occurrences"].min()]).copy()

In [42]:
lowest_df_counts_df = lowest_df["name"].value_counts().reset_index(name='Counts')

In [43]:
lowest_df_counts_df.to_csv("./output/least_popular_names_1880_2022.csv")

## Flourish table
<a href='https://public.flourish.studio/visualisation/14251690/'>Most Unique Baby Names</a>